espruino/Espruino/targetlibs/nrf5x/nrf5x_sdk/examples/ble_peripheral/experimental_ble_app_hrs_pairing_nfc/main.c
static uint16_t                          m_conn_handle = BLE_CONN_HANDLE_INVALID;   /**< Handle of the current connection. */
static ble_bas_t                         m_bas;                                     /**< Structure used to identify the battery service. */
static ble_hrs_t                         m_hrs;                                     /**< Structure used to identify the heart rate service. */
static bool                              m_rr_interval_enabled = true;              /**< Flag for enabling and disabling the registration of new RR interval measurements (the purpose of disabling this is just to test sending HRM without RR interval data. */

static sensorsim_cfg_t                   m_battery_sim_cfg;                         /**< Battery Level sensor simulator configuration. */
static sensorsim_state_t                 m_battery_sim_state;                       /**< Battery Level sensor simulator state. */
static sensorsim_cfg_t                   m_heart_rate_sim_cfg;                      /**< Heart Rate sensor simulator configuration. */
static sensorsim_state_t                 m_heart_rate_sim_state;                    /**< Heart Rate sensor simulator state. */
static sensorsim_cfg_t                   m_rr_interval_sim_cfg;                     /**< RR Interval sensor simulator configuration. */
static sensorsim_state_t                 m_rr_interval_sim_state;                   /**< RR Interval sensor simulator state. */

static app_timer_id_t                    m_battery_timer_id;                        /**< Battery timer. */
static app_timer_id_t                    m_heart_rate_timer_id;                     /**< Heart rate measurement timer. */
static app_timer_id_t                    m_rr_interval_timer_id;                    /**< RR interval timer. */
static app_timer_id_t                    m_sensor_contact_timer_id;                 /**< Sensor contact detected timer. */

static dm_application_instance_t         m_app_handle;                              /**< Application identifier allocated by device manager */

static ble_uuid_t m_adv_uuids[] = {{BLE_UUID_HEART_RATE_SERVICE,         BLE_UUID_TYPE_BLE},
                                   {BLE_UUID_BATTERY_SERVICE,            BLE_UUID_TYPE_BLE},
                                   {BLE_UUID_DEVICE_INFORMATION_SERVICE, BLE_UUID_TYPE_BLE}}; /**< Universally unique service identifiers. */
#ifdef BLE_DFU_APP_SUPPORT    
static ble_dfu_t                         m_dfus;                                    /**< Structure used to identify the DFU service. */
#endif // BLE_DFU_APP_SUPPORT    


/***************************************************************************************************
 * Start of modifications needed for BLE pairing over NFC
 **************************************************************************************************/
#include "nfc_lib.h"
#include "nfc_ble_pair_msg.h"
#include "nfc_ble_pair_msg_config.h"

#define NFC_BLE_JUST_WORKS_PAIRING       0  /**< Just Works pairing over NFC - Temporary Key (TK) always equal to 0 */
#define NFC_BLE_OOB_PAIRING              1  /**< Out-of-Band pairing over NFC - Temporary Key (TK) value can be configured. */
#define NFC_BLE_PAIRING_TYPE             NFC_BLE_JUST_WORKS_PAIRING

#if (NFC_BLE_PAIRING_TYPE == NFC_BLE_OOB_PAIRING)
    #define SEC_PARAM_MITM               0  /**< Man In The Middle protection not required. */
    #define SEC_PARAM_OOB                1  /**< Out Of Band data available. */
    // Hardcoded authentication OOB key
    #define OOB_AUTH_KEY                 {                            \
                                            {                         \
                                              0xAA, 0xBB, 0xCC, 0xDD, \
                                              0xEE, 0xFF, 0x99, 0x88, \
                                              0x77, 0x66, 0x55, 0x44, \
                                              0x33, 0x22, 0x11, 0x00  \
                                            }                         \
                                         }

    static ble_advdata_tk_value_t        m_oob_auth_key = OOB_AUTH_KEY;
#else
    #define SEC_PARAM_MITM               0  /**< Man In The Middle protection not required. */
    #define SEC_PARAM_OOB                0  /**< Out Of Band data not available. */
#endif /* NFC_BLE_PAIRING_TYPE */

static ble_advdata_t                     m_advdata;
static volatile uint8_t                  m_advertising_flag = 0;
/* Begin: Bugfix for FTPAN-45 */
extern volatile uint8_t                  m_nfc_active;
/* End:   Bugfix for FTPAN-45 */

static void advertising_disable(void);
static void advertising_enable(void);
static void on_ble_evt(ble_evt_t * p_ble_evt);

/***************************************************************************************************
 * End of modifications needed for BLE pairing over NFC
 **************************************************************************************************/

/**@brief Callback function for asserts in the SoftDevice.
 *
 * @details This function will be called in case of an assert in the SoftDevice.
 *
 * @warning This handler is an example only and does not fit a final product. You need to analyze
 *          how your product is supposed to react in case of Assert.
 * @warning On assert from the SoftDevice, the system can only recover on reset.
 *
 * @param[in] line_num   Line number of the failing ASSERT call.
 * @param[in] file_name  File name of the failing ASSERT call.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name)
{
    app_error_handler(DEAD_BEEF, line_num, p_file_name);
}


/**@brief Function for performing battery measurement and updating the Battery Level characteristic
 *        in Battery Service.
 */
static void battery_level_update(void)
{
    uint32_t err_code;
    uint8_t  battery_level;

    battery_level = (uint8_t)sensorsim_measure(&m_battery_sim_state, &m_battery_sim_cfg);

    err_code = ble_bas_battery_level_update(&m_bas, battery_level);
    if ((err_code != NRF_SUCCESS) &&
        (err_code != NRF_ERROR_INVALID_STATE) &&
        (err_code != BLE_ERROR_NO_TX_BUFFERS) &&
        (err_code != BLE_ERROR_GATTS_SYS_ATTR_MISSING)
        )
    {
        APP_ERROR_HANDLER(err_code);
    }
}


