espruino/Espruino/targetlibs/nrf5x/nrf5x_sdk/examples/ble_peripheral/experimental_ble_app_hrs_pairing_nfc/main.c
    err_code = dm_init(&init_param);
    APP_ERROR_CHECK(err_code);

    memset(&register_param.sec_param, 0, sizeof(ble_gap_sec_params_t));

    register_param.sec_param.bond         = SEC_PARAM_BOND;
    register_param.sec_param.mitm         = SEC_PARAM_MITM;
    register_param.sec_param.io_caps      = SEC_PARAM_IO_CAPABILITIES;
    register_param.sec_param.oob          = SEC_PARAM_OOB;
    register_param.sec_param.min_key_size = SEC_PARAM_MIN_KEY_SIZE;
    register_param.sec_param.max_key_size = SEC_PARAM_MAX_KEY_SIZE;
    register_param.evt_handler            = device_manager_evt_handler;
    register_param.service_type           = DM_PROTOCOL_CNTXT_GATT_SRVR_ID;

    err_code = dm_register(&m_app_handle, &register_param);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for initializing buttons and leds.
 *
 * @param[out] p_erase_bonds  Will be true if the clear bonding button was pressed to wake the application up.
 */
static void buttons_leds_init(bool * p_erase_bonds)
{
    bsp_event_t startup_event;

    uint32_t err_code = bsp_init(BSP_INIT_LED | BSP_INIT_BUTTONS,
                                 APP_TIMER_TICKS(100, APP_TIMER_PRESCALER),
                                 bsp_event_handler);
    APP_ERROR_CHECK(err_code);

    err_code = bsp_btn_ble_init(NULL, &startup_event);
    APP_ERROR_CHECK(err_code);

    *p_erase_bonds = (startup_event == BSP_EVENT_CLEAR_BONDING_DATA);
}

/***************************************************************************************************
 * Start of modifications needed for BLE pairing over NFC
 **************************************************************************************************/

/**@brief Function for handling the Application's BLE Stack events.
 *
 * @param[in] p_ble_evt  Bluetooth stack event.
 */
static void on_ble_evt(ble_evt_t * p_ble_evt)
{
    uint32_t err_code;

    switch (p_ble_evt->header.evt_id)
            {
        case BLE_GAP_EVT_CONNECTED:
            err_code = bsp_indication_set(BSP_INDICATE_CONNECTED);
            APP_ERROR_CHECK(err_code);
            m_conn_handle = p_ble_evt->evt.gap_evt.conn_handle;
            /* Disable advertising, so when disconnected it does not restart */
            advertising_disable();
            break;

        case BLE_GAP_EVT_DISCONNECTED:
            m_conn_handle = BLE_CONN_HANDLE_INVALID;
            m_advertising_flag = 0;

            break;

        case BLE_GAP_EVT_AUTH_KEY_REQUEST:

#if (NFC_BLE_PAIRING_TYPE == NFC_BLE_OOB_PAIRING)
            err_code = sd_ble_gap_auth_key_reply(p_ble_evt->evt.gap_evt.conn_handle, BLE_GAP_AUTH_KEY_TYPE_OOB, m_oob_auth_key.tk);
#else
            err_code = NRF_ERROR_INVALID_STATE;
#endif /* NFC_BLE_PAIRING_TYPE */
            APP_ERROR_CHECK(err_code);
            break;

        default:
            // No implementation needed.
            break;
    }
}

/**@brief Function for initializing the Advertising functionality.
 */
static void advertising_init(void)
{
    // Build advertising data struct to pass into @ref ble_advertising_init.
    memset(&m_advdata, 0, sizeof(m_advdata));
    //Only setup adv_data, options will be set depending if advertising will be enabled or not
    m_advdata.name_type               = BLE_ADVDATA_FULL_NAME;
    m_advdata.include_appearance      = true;
    m_advdata.flags                   = BLE_GAP_ADV_FLAGS_LE_ONLY_GENERAL_DISC_MODE;
    m_advdata.uuids_complete.uuid_cnt = sizeof(m_adv_uuids) / sizeof(m_adv_uuids[0]);
    m_advdata.uuids_complete.p_uuids  = m_adv_uuids;
}

/**@brief Function for re-initializing the Advertising module with fast advertising mode enabled.
 */
static void advertising_enable(void)
{
    uint32_t      err_code;

    ble_adv_modes_config_t options    = {0};
    options.ble_adv_fast_enabled  = BLE_ADV_FAST_ENABLED;
    options.ble_adv_fast_interval = APP_ADV_INTERVAL;
    options.ble_adv_fast_timeout  = APP_ADV_TIMEOUT_IN_SECONDS;

    err_code = ble_advertising_init(&m_advdata, NULL, &options, on_adv_evt, NULL);
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for re-initializing the Advertising module with all advertising modes disabled.
 */
static void advertising_disable(void)
{
    uint32_t      err_code;

    ble_adv_modes_config_t options    = {0};
    options.ble_adv_directed_enabled  = BLE_ADV_DIRECTED_DISABLED;
    options.ble_adv_fast_enabled      = BLE_ADV_FAST_DISABLED;
    options.ble_adv_slow_enabled      = BLE_ADV_SLOW_DISABLED;
    options.ble_adv_whitelist_enabled = BLE_ADV_WHITELIST_DISABLED;

    err_code = ble_advertising_init(&m_advdata, NULL, &options, on_adv_evt, NULL);
    APP_ERROR_CHECK(err_code);
}

static void nfc_callback(void * context, NfcEvent event, const char *data, size_t dataLength)
{
    (void) context;
    uint32_t err_code;

    switch (event)
    {
        case NFC_EVENT_FIELD_ON:
            LEDS_ON(BSP_LED_3_MASK);
            /* Start advertising to become connectable */
            if (!m_advertising_flag)
            {
                m_advertising_flag  = 1;
                advertising_enable();
                err_code = ble_advertising_start(BLE_ADV_MODE_FAST);
                APP_ERROR_CHECK(err_code);
            }
            break;
        case NFC_EVENT_FIELD_OFF:
            LEDS_OFF(BSP_LED_3_MASK);
            break;
        default:
            break;
    }
    return;
}

static void nfc_init(void)
{
    ble_advdata_t adv_data;
    uint8_t *     p_message;
    uint16_t      message_len;
    uint32_t      err_code = NRF_SUCCESS;
    NfcRetval     ret_val;
    

    /* Prepare advdata structure as input to create payload of the NFC message */
    memset((uint8_t *) &adv_data, 0, sizeof(ble_advdata_t));

    adv_data.include_appearance = true;
    adv_data.name_type          = BLE_ADVDATA_FULL_NAME;
#if (NFC_BLE_PAIRING_TYPE == NFC_BLE_OOB_PAIRING)
    adv_data.p_tk_value = &m_oob_auth_key;
#endif /* NFC_BLE_PAIRING_TYPE */

#if ((NFC_BLE_PAIR_MSG_CONFIG_MSG_TYPE == NFC_BLE_PAIR_MSG_BLUETOOTH_LE_SHORT) || \
     (NFC_BLE_PAIR_MSG_CONFIG_MSG_TYPE == NFC_BLE_PAIR_MSG_BLUETOOTH_LE_FULL))

    adv_data.include_ble_device_addr = true;
    adv_data.le_role                 = BLE_ADVDATA_ROLE_ONLY_PERIPH;
    adv_data.flags                   = BLE_GAP_ADV_FLAG_BR_EDR_NOT_SUPPORTED;

#elif ((NFC_BLE_PAIR_MSG_CONFIG_MSG_TYPE == NFC_BLE_PAIR_MSG_BLUETOOTH_EP_SHORT) || \
       (NFC_BLE_PAIR_MSG_CONFIG_MSG_TYPE == NFC_BLE_PAIR_MSG_BLUETOOTH_EP_FULL))

    uint8_t sec_mgr_oob_flags = (AD_TYPE_SEC_MGR_OOB_FLAG_SET   << AD_TYPE_SEC_MGR_OOB_FLAG_OOB_DATA_PRESENT_POS) |
                                (AD_TYPE_SEC_MGR_OOB_FLAG_SET   << AD_TYPE_SEC_MGR_OOB_FLAG_OOB_LE_SUPPORTED_POS) |
                                (AD_TYPE_SEC_MGR_OOB_FLAG_CLEAR << AD_TYPE_SEC_MGR_OOB_FLAG_SIM_LE_AND_EP_POS)    |
                                (AD_TYPE_SEC_MGR_OOB_ADDRESS_TYPE_RANDOM << AD_TYPE_SEC_MGR_OOB_FLAG_ADDRESS_TYPE_POS);
    adv_data.p_sec_mgr_oob_flags = &sec_mgr_oob_flags;

#else
    #error "Error. Type of NFC NDEF message used for BLE pairing over NFC not specified."
#endif /* NFC_BLE_PAIR_MSG_CONFIG_MSG_TYPE */

