espruino/Espruino/targetlibs/nrf5x/nrf5x_sdk/examples/ble_peripheral/experimental_ble_app_hrs_pairing_nfc/main.c
    /* Create the NFC message */
    err_code = nfc_ble_pair_msg_create(&adv_data, &p_message, &message_len);
    APP_ERROR_CHECK(err_code);

    /* Start NFC */
    ret_val = nfcSetup(nfc_callback, NULL);
    if (ret_val != NFC_RETVAL_OK)
    {
        APP_ERROR_CHECK((uint32_t) ret_val);
    }

    ret_val = nfcSetPayload((char *)p_message, message_len);
    if (ret_val != NFC_RETVAL_OK)
    {
        APP_ERROR_CHECK((uint32_t) ret_val);
    }

    ret_val = nfcStartEmulation();
    if (ret_val != NFC_RETVAL_OK)
    {
        APP_ERROR_CHECK((uint32_t) ret_val);
    }

    return;
}


/**@brief Function for the Power manager.
 */
static void power_manage(void)
{
    /* Begin: Bugfix for FTPAN-45 */
    if (!m_nfc_active)
    {
    /* End:   Bugfix for FTPAN-45 */
        uint32_t err_code = sd_app_evt_wait();
        APP_ERROR_CHECK(err_code);
    /* Begin: Bugfix for FTPAN-45 */
    }
    /* End:   Bugfix for FTPAN-45 */
}

/**@brief Function for application main entry.
 */
int main(void)
{
    bool erase_bonds;

    // Initialize.
    timers_init();
    buttons_leds_init(&erase_bonds);
    ble_stack_init();
    device_manager_init(erase_bonds);
    gap_params_init();
    advertising_init();
    services_init();
    sensor_simulator_init();
    conn_params_init();
    nfc_init();

    // Start execution.
    application_timers_start();

    // Enter main loop.
    for (;;)
    {
        power_manage();
    }
}
/***************************************************************************************************
 * End of modifications needed for BLE pairing over NFC
 **************************************************************************************************/
